grevaillot/svd_tools/headers/STM32GBK1CBT6/tim3.h
#pragma once 

/* --- TIM3: Advanced-timers ---------------------------------------- */

/** @defgroup tim3_registers Advanced-timers Register
@{*/

/** TIM3_CR1 control register 1 **/
#define TIM3_CR1			MMIO32(TIM3_BASE + 0x00)
/** TIM3_CR2 control register 2 **/
#define TIM3_CR2			MMIO32(TIM3_BASE + 0x04)
/** TIM3_SMCR slave mode control register **/
#define TIM3_SMCR			MMIO32(TIM3_BASE + 0x08)
/** TIM3_DIER DMA/Interrupt enable register **/
#define TIM3_DIER			MMIO32(TIM3_BASE + 0x0c)
/** TIM3_SR status register **/
#define TIM3_SR			MMIO32(TIM3_BASE + 0x10)
/** TIM3_EGR event generation register **/
#define TIM3_EGR			MMIO32(TIM3_BASE + 0x14)
/** TIM3_CCMR1_Output capture/compare mode register 1 (output mode) **/
#define TIM3_CCMR1_Output			MMIO32(TIM3_BASE + 0x18)
/** TIM3_CCMR1_Input capture/compare mode register 1 (input mode) **/
#define TIM3_CCMR1_Input			MMIO32(TIM3_BASE + 0x18)
/** TIM3_CCMR2_Output capture/compare mode register 2 (output mode) **/
#define TIM3_CCMR2_Output			MMIO32(TIM3_BASE + 0x1c)
/** TIM3_CCMR2_Input capture/compare mode register 2 (input mode) **/
#define TIM3_CCMR2_Input			MMIO32(TIM3_BASE + 0x1c)
/** TIM3_CCER capture/compare enable register **/
#define TIM3_CCER			MMIO32(TIM3_BASE + 0x20)
/** TIM3_CNT counter **/
#define TIM3_CNT			MMIO32(TIM3_BASE + 0x24)
/** TIM3_PSC prescaler **/
#define TIM3_PSC			MMIO32(TIM3_BASE + 0x28)
/** TIM3_ARR auto-reload register **/
#define TIM3_ARR			MMIO32(TIM3_BASE + 0x2c)
/** TIM3_RCR repetition counter register **/
#define TIM3_RCR			MMIO32(TIM3_BASE + 0x30)
/** TIM3_CCR1 capture/compare register 1 **/
#define TIM3_CCR1			MMIO32(TIM3_BASE + 0x34)
/** TIM3_CCR2 capture/compare register 2 **/
#define TIM3_CCR2			MMIO32(TIM3_BASE + 0x38)
/** TIM3_CCR3 capture/compare register 3 **/
#define TIM3_CCR3			MMIO32(TIM3_BASE + 0x3c)
/** TIM3_CCR4 capture/compare register 4 **/
#define TIM3_CCR4			MMIO32(TIM3_BASE + 0x40)
/** TIM3_BDTR break and dead-time register **/
#define TIM3_BDTR			MMIO32(TIM3_BASE + 0x44)
/** TIM3_CCR5 capture/compare register 4 **/
#define TIM3_CCR5			MMIO32(TIM3_BASE + 0x48)
/** TIM3_CCR6 capture/compare register 4 **/
#define TIM3_CCR6			MMIO32(TIM3_BASE + 0x4c)
/** TIM3_CCMR3_Output capture/compare mode register 2 (output mode) **/
#define TIM3_CCMR3_Output			MMIO32(TIM3_BASE + 0x50)
/** TIM3_DTR2 timer Deadtime Register 2 **/
#define TIM3_DTR2			MMIO32(TIM3_BASE + 0x54)
/** TIM3_ECR DMA control register **/
#define TIM3_ECR			MMIO32(TIM3_BASE + 0x58)
/** TIM3_TISEL TIM timer input selection register **/
#define TIM3_TISEL			MMIO32(TIM3_BASE + 0x5c)
/** TIM3_AF1 TIM alternate function option register 1 **/
#define TIM3_AF1			MMIO32(TIM3_BASE + 0x60)
/** TIM3_AF2 TIM alternate function option register 2 **/
#define TIM3_AF2			MMIO32(TIM3_BASE + 0x64)
/** TIM3_DCR control register **/
#define TIM3_DCR			MMIO32(TIM3_BASE + 0x3dc)
/** TIM3_DMAR DMA address for full transfer **/
#define TIM3_DMAR			MMIO32(TIM3_BASE + 0x3e0)

/**@}*/


/** @defgroup tim3_cr1 CR1 control register 1
@{*/

/** TIM3_CR1_DITHEN Dithering Enable **/
#define TIM3_CR1_DITHEN		(1 << 12)
/** TIM3_CR1_UIFREMAP UIF status bit remapping **/
#define TIM3_CR1_UIFREMAP		(1 << 11)

#define TIM3_CR1_CKD_SHIFT		8
#define TIM3_CR1_CKD_MASK		0x03
/** @defgroup tim3_cr1_ckd CKD Clock division
@{*/
/**@}*/

/** TIM3_CR1_ARPE Auto-reload preload enable **/
#define TIM3_CR1_ARPE		(1 << 7)

#define TIM3_CR1_CMS_SHIFT		5
#define TIM3_CR1_CMS_MASK		0x03
/** @defgroup tim3_cr1_cms CMS Center-aligned mode selection
@{*/
/**@}*/

/** TIM3_CR1_DIR Direction **/
#define TIM3_CR1_DIR		(1 << 4)
/** TIM3_CR1_OPM One-pulse mode **/
#define TIM3_CR1_OPM		(1 << 3)
/** TIM3_CR1_URS Update request source **/
#define TIM3_CR1_URS		(1 << 2)
/** TIM3_CR1_UDIS Update disable **/
#define TIM3_CR1_UDIS		(1 << 1)
/** TIM3_CR1_CEN Counter enable **/
#define TIM3_CR1_CEN		(1 << 0)

/**@}*/

/** @defgroup tim3_cr2 CR2 control register 2
@{*/

/** TIM3_CR2_MMS_3 Master mode selection - bit 3 **/
#define TIM3_CR2_MMS_3		(1 << 25)

#define TIM3_CR2_MMS2_SHIFT		20
#define TIM3_CR2_MMS2_MASK		0x0f
/** @defgroup tim3_cr2_mms2 MMS2 Master mode selection 2
@{*/
/**@}*/

/** TIM3_CR2_OIS6 Output Idle state 6 (OC6 output) **/
#define TIM3_CR2_OIS6		(1 << 18)
/** TIM3_CR2_OIS5 Output Idle state 5 (OC5 output) **/
#define TIM3_CR2_OIS5		(1 << 16)
/** TIM3_CR2_OIS4N Output Idle state 4 (OC4N output) **/
#define TIM3_CR2_OIS4N		(1 << 15)
/** TIM3_CR2_OIS4 Output Idle state 4 **/
#define TIM3_CR2_OIS4		(1 << 14)
/** TIM3_CR2_OIS3N Output Idle state 3 **/
#define TIM3_CR2_OIS3N		(1 << 13)
/** TIM3_CR2_OIS3 Output Idle state 3 **/
#define TIM3_CR2_OIS3		(1 << 12)
/** TIM3_CR2_OIS2N Output Idle state 2 **/
#define TIM3_CR2_OIS2N		(1 << 11)
/** TIM3_CR2_OIS2 Output Idle state 2 **/
#define TIM3_CR2_OIS2		(1 << 10)
/** TIM3_CR2_OIS1N Output Idle state 1 **/
#define TIM3_CR2_OIS1N		(1 << 9)
/** TIM3_CR2_OIS1 Output Idle state 1 **/
#define TIM3_CR2_OIS1		(1 << 8)
/** TIM3_CR2_TI1S TI1 selection **/
#define TIM3_CR2_TI1S		(1 << 7)

#define TIM3_CR2_MMS_SHIFT		4
#define TIM3_CR2_MMS_MASK		0x07
/** @defgroup tim3_cr2_mms MMS Master mode selection
@{*/
/**@}*/

/** TIM3_CR2_CCDS Capture/compare DMA selection **/
#define TIM3_CR2_CCDS		(1 << 3)
/** TIM3_CR2_CCUS Capture/compare control update selection **/
#define TIM3_CR2_CCUS		(1 << 2)
/** TIM3_CR2_CCPC Capture/compare preloaded control **/
#define TIM3_CR2_CCPC		(1 << 0)

/**@}*/

/** @defgroup tim3_smcr SMCR slave mode control register
@{*/

/** TIM3_SMCR_SMSPS SMS Preload Source **/
#define TIM3_SMCR_SMSPS		(1 << 25)
/** TIM3_SMCR_SMSPE SMS Preload Enable **/
#define TIM3_SMCR_SMSPE		(1 << 24)

#define TIM3_SMCR_TS_4_3_SHIFT		20
#define TIM3_SMCR_TS_4_3_MASK		0x03
/** @defgroup tim3_smcr_ts_4_3 TS43 Trigger selection - bit 4:3
@{*/
/**@}*/

/** TIM3_SMCR_SMS_3 Slave mode selection - bit 3 **/
#define TIM3_SMCR_SMS_3		(1 << 16)
/** TIM3_SMCR_ETP External trigger polarity **/
#define TIM3_SMCR_ETP		(1 << 15)
/** TIM3_SMCR_ECE External clock enable **/
#define TIM3_SMCR_ECE		(1 << 14)

#define TIM3_SMCR_ETPS_SHIFT		12
#define TIM3_SMCR_ETPS_MASK		0x03
/** @defgroup tim3_smcr_etps ETPS External trigger prescaler
@{*/
/**@}*/


#define TIM3_SMCR_ETF_SHIFT		8
#define TIM3_SMCR_ETF_MASK		0x0f
/** @defgroup tim3_smcr_etf ETF External trigger filter
@{*/
/**@}*/

/** TIM3_SMCR_MSM Master/Slave mode **/
#define TIM3_SMCR_MSM		(1 << 7)

#define TIM3_SMCR_TS_SHIFT		4
#define TIM3_SMCR_TS_MASK		0x07
/** @defgroup tim3_smcr_ts TS Trigger selection
@{*/
/**@}*/

