grevaillot/svd_tools/headers/STM32GBK1CBT6/tim3.h
/** @defgroup tim3_ccmr1_input CCMR1Input capture/compare mode register 1 (input mode)
@{*/


#define TIM3_CCMR1_Input_IC2F_SHIFT		12
#define TIM3_CCMR1_Input_IC2F_MASK		0x0f
/** @defgroup tim3_ccmr1_input_ic2f IC2F Input capture 2 filter
@{*/
/**@}*/


#define TIM3_CCMR1_Input_IC2PSC_SHIFT		10
#define TIM3_CCMR1_Input_IC2PSC_MASK		0x03
/** @defgroup tim3_ccmr1_input_ic2psc IC2PSC Input capture 2 prescaler
@{*/
/**@}*/


#define TIM3_CCMR1_Input_CC2S_SHIFT		8
#define TIM3_CCMR1_Input_CC2S_MASK		0x03
/** @defgroup tim3_ccmr1_input_cc2s CC2S Capture/Compare 2 selection
@{*/
/**@}*/


#define TIM3_CCMR1_Input_IC1F_SHIFT		4
#define TIM3_CCMR1_Input_IC1F_MASK		0x0f
/** @defgroup tim3_ccmr1_input_ic1f IC1F Input capture 1 filter
@{*/
/**@}*/


#define TIM3_CCMR1_Input_ICPCS_SHIFT		2
#define TIM3_CCMR1_Input_ICPCS_MASK		0x03
/** @defgroup tim3_ccmr1_input_icpcs ICPCS Input capture 1 prescaler
@{*/
/**@}*/


#define TIM3_CCMR1_Input_CC1S_SHIFT		0
#define TIM3_CCMR1_Input_CC1S_MASK		0x03
/** @defgroup tim3_ccmr1_input_cc1s CC1S Capture/Compare 1 selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tim3_ccmr2_output CCMR2Output capture/compare mode register 2 (output mode)
@{*/

/** TIM3_CCMR2_Output_OC4M_3 Output Compare 4 mode - bit 3 **/
#define TIM3_CCMR2_Output_OC4M_3		(1 << 24)
/** TIM3_CCMR2_Output_OC3M_3 Output Compare 3 mode - bit 3 **/
#define TIM3_CCMR2_Output_OC3M_3		(1 << 16)
/** TIM3_CCMR2_Output_OC4CE Output compare 4 clear enable **/
#define TIM3_CCMR2_Output_OC4CE		(1 << 15)

#define TIM3_CCMR2_Output_OC4M_SHIFT		12
#define TIM3_CCMR2_Output_OC4M_MASK		0x07
/** @defgroup tim3_ccmr2_output_oc4m OC4M Output compare 4 mode
@{*/
/**@}*/

/** TIM3_CCMR2_Output_OC4PE Output compare 4 preload enable **/
#define TIM3_CCMR2_Output_OC4PE		(1 << 11)
/** TIM3_CCMR2_Output_OC4FE Output compare 4 fast enable **/
#define TIM3_CCMR2_Output_OC4FE		(1 << 10)

#define TIM3_CCMR2_Output_CC4S_SHIFT		8
#define TIM3_CCMR2_Output_CC4S_MASK		0x03
/** @defgroup tim3_ccmr2_output_cc4s CC4S Capture/Compare 4 selection
@{*/
/**@}*/

/** TIM3_CCMR2_Output_OC3CE Output compare 3 clear enable **/
#define TIM3_CCMR2_Output_OC3CE		(1 << 7)

#define TIM3_CCMR2_Output_OC3M_SHIFT		4
#define TIM3_CCMR2_Output_OC3M_MASK		0x07
/** @defgroup tim3_ccmr2_output_oc3m OC3M Output compare 3 mode
@{*/
/**@}*/

/** TIM3_CCMR2_Output_OC3PE Output compare 3 preload enable **/
#define TIM3_CCMR2_Output_OC3PE		(1 << 3)
/** TIM3_CCMR2_Output_OC3FE Output compare 3 fast enable **/
#define TIM3_CCMR2_Output_OC3FE		(1 << 2)

#define TIM3_CCMR2_Output_CC3S_SHIFT		0
#define TIM3_CCMR2_Output_CC3S_MASK		0x03
/** @defgroup tim3_ccmr2_output_cc3s CC3S Capture/Compare 3 selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tim3_ccmr2_input CCMR2Input capture/compare mode register 2 (input mode)
@{*/


#define TIM3_CCMR2_Input_IC4F_SHIFT		12
#define TIM3_CCMR2_Input_IC4F_MASK		0x0f
/** @defgroup tim3_ccmr2_input_ic4f IC4F Input capture 4 filter
@{*/
/**@}*/


#define TIM3_CCMR2_Input_IC4PSC_SHIFT		10
#define TIM3_CCMR2_Input_IC4PSC_MASK		0x03
/** @defgroup tim3_ccmr2_input_ic4psc IC4PSC Input capture 4 prescaler
@{*/
/**@}*/


#define TIM3_CCMR2_Input_CC4S_SHIFT		8
#define TIM3_CCMR2_Input_CC4S_MASK		0x03
/** @defgroup tim3_ccmr2_input_cc4s CC4S Capture/Compare 4 selection
@{*/
/**@}*/


#define TIM3_CCMR2_Input_IC3F_SHIFT		4
#define TIM3_CCMR2_Input_IC3F_MASK		0x0f
/** @defgroup tim3_ccmr2_input_ic3f IC3F Input capture 3 filter
@{*/
/**@}*/


#define TIM3_CCMR2_Input_IC3PSC_SHIFT		2
#define TIM3_CCMR2_Input_IC3PSC_MASK		0x03
/** @defgroup tim3_ccmr2_input_ic3psc IC3PSC Input capture 3 prescaler
@{*/
/**@}*/


#define TIM3_CCMR2_Input_CC3S_SHIFT		0
#define TIM3_CCMR2_Input_CC3S_MASK		0x03
/** @defgroup tim3_ccmr2_input_cc3s CC3S Capture/compare 3 selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tim3_ccer CCER capture/compare enable register
@{*/

/** TIM3_CCER_CC6P Capture/Compare 6 output polarity **/
#define TIM3_CCER_CC6P		(1 << 21)
/** TIM3_CCER_CC6E Capture/Compare 6 output enable **/
#define TIM3_CCER_CC6E		(1 << 20)
/** TIM3_CCER_CC5P Capture/Compare 5 output polarity **/
#define TIM3_CCER_CC5P		(1 << 17)
/** TIM3_CCER_CC5E Capture/Compare 5 output enable **/
#define TIM3_CCER_CC5E		(1 << 16)
/** TIM3_CCER_CC4NP Capture/Compare 4 complementary output polarity **/
#define TIM3_CCER_CC4NP		(1 << 15)
/** TIM3_CCER_CC4NE Capture/Compare 4 complementary output enable **/
#define TIM3_CCER_CC4NE		(1 << 14)
/** TIM3_CCER_CC4P Capture/Compare 3 output Polarity **/
#define TIM3_CCER_CC4P		(1 << 13)
/** TIM3_CCER_CC4E Capture/Compare 4 output enable **/
#define TIM3_CCER_CC4E		(1 << 12)
/** TIM3_CCER_CC3NP Capture/Compare 3 output Polarity **/
#define TIM3_CCER_CC3NP		(1 << 11)
/** TIM3_CCER_CC3NE Capture/Compare 3 complementary output enable **/
#define TIM3_CCER_CC3NE		(1 << 10)
/** TIM3_CCER_CC3P Capture/Compare 3 output Polarity **/
#define TIM3_CCER_CC3P		(1 << 9)
/** TIM3_CCER_CC3E Capture/Compare 3 output enable **/
#define TIM3_CCER_CC3E		(1 << 8)
/** TIM3_CCER_CC2NP Capture/Compare 2 output Polarity **/
#define TIM3_CCER_CC2NP		(1 << 7)
/** TIM3_CCER_CC2NE Capture/Compare 2 complementary output enable **/
#define TIM3_CCER_CC2NE		(1 << 6)
/** TIM3_CCER_CC2P Capture/Compare 2 output Polarity **/
#define TIM3_CCER_CC2P		(1 << 5)
/** TIM3_CCER_CC2E Capture/Compare 2 output enable **/
#define TIM3_CCER_CC2E		(1 << 4)
/** TIM3_CCER_CC1NP Capture/Compare 1 output Polarity **/
#define TIM3_CCER_CC1NP		(1 << 3)
/** TIM3_CCER_CC1NE Capture/Compare 1 complementary output enable **/
#define TIM3_CCER_CC1NE		(1 << 2)
/** TIM3_CCER_CC1P Capture/Compare 1 output Polarity **/
#define TIM3_CCER_CC1P		(1 << 1)
/** TIM3_CCER_CC1E Capture/Compare 1 output enable **/
#define TIM3_CCER_CC1E		(1 << 0)

/**@}*/

/** @defgroup tim3_cnt CNT counter
@{*/

/** TIM3_CNT_UIFCPY UIFCPY **/
#define TIM3_CNT_UIFCPY		(1 << 31)

#define TIM3_CNT_CNT_SHIFT		0
#define TIM3_CNT_CNT_MASK		0xffff
/** @defgroup tim3_cnt_cnt CNT counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim3_psc PSC prescaler
@{*/


